import"..Bl5S998A.js";import{u as r}from"./main.DT5YboeZ.js";import{k as h}from"./hooks.module.cQQMXFsl.js";function i(e){const n={h2:"h2",hr:"hr",p:"p",...e.components};return r(h,{children:[r(n.hr,{}),`
`,r(n.h2,{children:`title: 처음으로 작성해보는 포스트\r
writer: Mina\r
tags: [personal]\r
layout: layouts/posts.tsx\r
lang: kr`}),`
`,r(n.h2,{children:"tl;dr"}),`
`,r(n.p,{children:"기술블로그 시작했습니다. 기술 이야기만 하게 노력할 겁니다. 잘 부탁드립니다."}),`
`,r(n.h2,{children:"블로그를 작성하겠다고 마음먹은 이유"}),`
`,r(n.p,{children:`사실 블로그를 해야겠다는 생각은 예전부터 가지고 있었는데... 누가 개발자\r
아니랄까봐 블로그는 손으로 처음부터 파야지 하고 ~~생각만~~ 하고\r
있었습니다(생각만 개발자고 부지런함은 백수인가 봐요).`}),`
`,r(n.p,{children:`그러다가 얼마 전에... 대학동아리에서 기술 블로그를 작성해보자! 라고 이야기가\r
나오게 됐었는데... 그때 그냥 지금이라도 하자! 라고 생각했던 게 이렇게 블로그\r
시작이 되었네요.`}),`
`,r(n.h2,{children:"블로그 기술스택?"}),`
`,r(n.p,{children:`Deno의 Static website Generator인 Lume를 사용하고 있습니다. 지금 여러분이 보고\r
계신 이 문서 또한 마크다운을 렌더링하여 빌드해낸 식이죠!`}),`
`,r(n.p,{children:`Lume같은 경우 많은 렌더링 엔진과 플러그인이 굉장히 자연스럽게 이어지게\r
프로그래밍 되어 있는데, 이 덕분에 저는 MD/MDX(마크다운 기반)를 통해 글을\r
작성하고, 마크다운으로 해결하기 힘든 요소들(Navbar라던지, Footer라던지 등등,\r
주로 레이아웃)은 Markdown을 Children으로 받아오는 Preact-JSX/TSX 기반으로 만들고\r
있어요.`}),`
`,r(n.p,{children:`사실 원래 주 분야가 백엔드였던 만큼, 아직까지도 제게 CSS는 너무 어색한\r
친구입니다(웹에서 제일 못하는 게 CSS에요...). CSS 프레임워크로써는 TailwindCSS를\r
선택하기는 했는데, 얼마나 갈 지 솔직히 잘 모르겠어요.`}),`
`,r(n.p,{children:`그 외에 댓글 시스템은 Github Issue와 연동되는 Utterances라는 라이브러리를\r
사용했어요.`}),`
`,r(n.p,{children:`그 외의 내용들에 대해서는 이 블로그 레포 소스코드가 공개되어 있기 때문에,\r
소스코드를 찬찬히 읽어 보시는 것도 괜찮을 듯 합니다!`}),`
`,r(n.h2,{children:"블로그에 담고 싶은 이야기"}),`
`,r(n.p,{children:`사실 저는 개인적으로, 기술 블로그에는 기술 이야기만 있는 게 좋다고 생각합니다.\r
블로그를 방문하시는 분들도 제가 평소에 뭘 하고 이런거보다는 백준 문제 풀이, 처음\r
보는 신기한 기술 스택, 서버 터트려먹고 복구한 이야기 등을 더 듣고 싶어 하시기도\r
할 거라고 생각하기도 하고요.`}),`
`,r(n.p,{children:`제 개인적인 이야기...를 할 공간이 인터넷에 있는 게 오히려 더 무섭다고도 생각하고\r
있어요. 다들 어렸을 때 SNS에 사고 한두개씩 치잖아요? 그런 느낌으로... 사고를\r
없애는 방법은 아예 작동하지 않는 거죠.`}),`
`,r(n.p,{children:`그래서 이 도메인에 올라가는 내용은 가능한 제 이야기는 덜어낸 채로 기술 이야기만\r
하려고 합니다. 완전히 덜어낼 것이라고 이야기를 드리지 못하는 이유는, 제 경험에\r
대한 설명이 밑바탕이 되어야만 설명할 수 있는 이야기가 있기 때문이에요.`}),`
`,r(n.p,{children:`아무튼 이야기가 길어졌지만... 결론은, 기술 이야기만 담는 블로그를 지향하고 있다!\r
라고 보면 될 거 같습니다.`}),`
`,r(n.h2,{children:"얼마나 자주 글을 올릴 것인가"}),`
`,r(n.p,{children:`마음만은 매일 올리고 싶은게 사람 욕심이지만, 잘 안 될 거라는 걸 알죠(~~그도\r
그럴게 단순히 집에 늦게 오는걸~~)...`}),`
`,r(n.p,{children:`따라서, 희망 사항은 매일! 늦어도 일주일에 한번 정도로 계획하고 있습니다.\r
일주일에 한번 정도는 담기 좋은 이야기가 생각 나지 않을까요.`}),`
`,r(n.p,{children:`무엇보다, 제 본업은 어디까지나 개발자지 기자나 작가가 아니라고 생각해요.\r
부가적으로, 하면 더 좋은 일이지만 여기에 잡아먹혀 본업을 소홀히 하는 일은 없어야\r
한다고 생각합니다.`}),`
`,r(n.h2,{children:"블로그에 넣고 싶은 기능들"}),`
`,r(n.p,{children:`개인적으로 해보고 싶은건, RSS나, 메일 알람 시스템? 어짜피 Github Action으로\r
빌드되고 배포될 거기 때문에...이 부분을 잘 만지작거리면 만들어낼 수 있지 않을까\r
생각하고 있어요.`}),`
`,r(n.h2,{children:"마무리하며"}),`
`,r(n.p,{children:"사실 이 글을 쓰고 있는 지금도 어떤 글이 쌓이게 될지 상상이 되지 않습니다."}),`
`,r(n.p,{children:"아마 되게 많은 분야의 글을 쓰게 될 수도 있을 거 같다는 생각도 들고요."}),`
`,r(n.p,{children:`지금 하고 있는 분야는 웹(백/프론트엔드), 앱(플러터 기반\r
멀티플랫폼/안드로이드-Kotlin 네이티브), 서버 데브옵스, 개발 인프라, 개발문화\r
관리가 될 거 같고, 기회가 된다면 AI쪽도 진행해 보고 싶은 생각이 있어요(회사에서\r
시키면 어쩔 수 없이 하겠지만).`}),`
`,r(n.p,{children:`요즘 대표님이 살살 AI 키워드를 꺼내는 게 무섭긴 한데... 제 의지로 AI를 시작해\r
보고 싶네요.`}),`
`,r(n.p,{children:`글이 많이 길어졌습니다. 아마 이 블로그에 올라가는 처음이자 마지막 개인 이야기\r
글이 될 거 같아요.`}),`
`,r(n.p,{children:"블로그 스타일 쪽은 계속 만지면서 진행할 생각이니...앞으로 잘 부탁드릴게요!"})]})}function d(e={}){const{wrapper:n}=e.components||{};return n?r(n,{...e,children:r(i,{...e})}):i(e)}export{d as default};
